---
kind: other
id: Properties.T:Autodesk.Revit.DB.ElementIdParameterValue
source: html/b1da47cc-5a93-2f2f-0f7a-71cbbd4a7c61.htm
---
# ElementIdParameterValue Properties

Specifies whether the .NET object represents a valid Revit entity.